In [2]:
import pandas as pd

### Little bit of Definition
- A pandas **DataFrame** is like a table where we have rows and columns
- A pandas **Series** is a single column from a **DataFrame**

### Merging/Joining DataFrames(sql inside pandas!!)

In [9]:

raw_city_names = {
    'id': [1,2,3,4,5],
    'city': ['Tripoli', 'London', 'Rome', 'Cairo', 'Sydney']
}

raw_city_population = {
    'id': [1,2,3,4,5],
    'population': ['2M', '10M', '1M', '20M', '3M'],
    'rank': ['1st', '2nd', '3rd', '4th', '5th']
}

df_city_name = pd.DataFrame(raw_city_names)
df_city_population = pd.DataFrame(raw_city_population)

In [10]:
df_city_name

      city  id
0  Tripoli   1
1   London   2
2     Rome   3
3    Cairo   4
4   Sydney   5

In [11]:
df_city_population

   id population rank
0   1         2M  1st
1   2        10M  2nd
2   3         1M  3rd
3   4        20M  4th
4   5         3M  5th

In [12]:
pd.merge(df_city_name,df_city_population,how='inner',on='id')

      city  id population rank
0  Tripoli   1         2M  1st
1   London   2        10M  2nd
2     Rome   3         1M  3rd
3    Cairo   4        20M  4th
4   Sydney   5         3M  5th

### Dropping Duplicate rows from DataFrame(Potential Overfitting)
If the dataset contains duplicate data points in the feature space, this may result in overfitting. Identifying and removing duplicates has been made easy in pandas.Let's take a look.

In [2]:
import pandas as pd

In [4]:
# read a dataset of movie reviewers into a DataFrame
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [5]:
users.shape

(943, 4)

In [9]:
# returns a boolean series where True indicates the corresponding row in the dataframe appears more than once
# in the dataset
duplicated_bool_series = users.duplicated()
duplicated_bool_series.head()

user_id
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [11]:
# now let's count number of duplciate rows
# note that boolean True is converted to 1 while False is converted to 0
duplicated_bool_series.sum()

7

In [12]:
# examine the duplicate rows (ignoring the first occurrence)
# this is the default behavior
# note that a boolean series can be used as index for the row selection
users.loc[duplicated_bool_series, :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [17]:
# The 7 duplicate rows have been dropped and size of the dataframe has been reduced
duplicates_dropped_users = users.drop_duplicates()
duplicates_dropped_users.shape

(936, 4)

In [19]:
# now we may wish to consider only specific columns while thinking about duplicates
duplicates_dropped_users = users.drop_duplicates(subset=['age','gender','occupation'])
duplicates_dropped_users.shape

(526, 4)

### Sort DataFrame by some columns

In [23]:
# read a dataset of top-rated IMDb movies into a DataFrame
movies = pd.read_table('http://bit.ly/imdbratings',sep=',')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [27]:
# sort the DataFrame first by 'duration', then by 'star_rating'
# for duration, sort in ascending order
# for star_rating, sort in descending order
res = movies.sort_values(by=['duration','star_rating'] ,ascending=[True,False])
res.head()

,star_rating,title,content_rating,genre,duration,actors_list
389,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."
338,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
258,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
88,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
293,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"

### Handling Missing values(NaN)

In [64]:
# read a dataset of UFO reports into a DataFrame
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

**What does "NaN" mean?**
- "NaN" is not a string, rather it's a special value: numpy.nan.
- It stands for "Not a Number" and indicates a missing value.
- read_csv detects missing values (by default) when reading the file, and replaces them with this special value.

In [66]:
# missing values can be detected using isnull() method
# which returns True if the corresponding value in the DataFrame is NaN
ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

In [68]:
# count number of missing values in a specific column
ufo['City'].isnull().sum()

25

In [71]:
# count number of missing values in a every column
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [72]:
# if 'any' values are missing in a row, then drop that row
ufo.dropna(how='any').shape

(2486, 5)

In [73]:
# if 'any' values are missing in a row (considering only 'City' and 'Shape Reported'), then drop that row
ufo.dropna(subset=['City', 'Shape Reported'], how='any').shape

(15576, 5)

In [74]:
# 'value_counts' does not include missing values by default
ufo['Shape Reported'].value_counts().head()

LIGHT       2803
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
Name: Shape Reported, dtype: int64

In [77]:
# explicitly include missing values
ufo['Shape Reported'].value_counts(dropna=False).head()

LIGHT       2803
NaN         2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64

### Row Filtering(Select the rows where the column/columns satisfy some specific condition)

In [30]:
res = movies[(movies['star_rating']>8) & (movies['duration']<=200)]

In [33]:
# by sorting in descending order after selection, we can check if any movie with duration 
# greater than 200 has been selected
res.sort_values(by=['duration'] ,ascending=[False]).head()

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
8,8.9,Schindler's List,R,Biography,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
220,8.1,Gandhi,PG,Biography,191,"[u'Ben Kingsley', u'John Gielgud', u'Candice B..."
89,8.4,Swades,NOT RATED,Drama,189,"[u'Shah Rukh Khan', u'Gayatri Joshi', u'Kishor..."
40,8.5,The Green Mile,R,Crime,189,"[u'Tom Hanks', u'Michael Clarke Duncan', u'Dav..."

In [34]:
# same kind of checking can be used for star_rating(just ascending sort in this case)
res.sort_values(by=['star_rating'] ,ascending=[True]).head()

,star_rating,title,content_rating,genre,duration,actors_list
296,8.1,The Wild Bunch,R,Action,145,"[u'William Holden', u'Ernest Borgnine', u'Robe..."
221,8.1,Solaris,PG,Drama,167,"[u'Natalya Bondarchuk', u'Donatas Banionis', u..."
222,8.1,Harry Potter and the Deathly Hallows: Part 2,PG-13,Adventure,130,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
224,8.1,The Wizard of Oz,PASSED,Adventure,102,"[u'Judy Garland', u'Frank Morgan', u'Ray Bolger']"
225,8.1,3-Iron,R,Crime,88,"[u'Seung-yeon Lee', u'Hyun-kyoon Lee', u'Hyuk-..."

### Apply functions to a pandas Series or DataFrame

In [4]:
# read the training dataset from Kaggle's Titanic competition into a DataFrame
train = pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# summary of a pandas Series 
train['Sex'].describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

In [6]:
# map is a Pandas Series method
train['sex_num'] = train['Sex'].map({'male':1,'female':0})

In [7]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sex_num
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [8]:
# this type of mapping can be very useful for ordinal features()
# e.g {'small':0,'medium':1,'big':2}
# however, never do this for a categorical feature like country_name casue that may introduce false structure 
train.drop('Sex',axis=1).head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sex_num
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,1

In [9]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
sex_num          0
dtype: int64

In [16]:
# round up each element in the 'Fare' Series to the next integer
# note that the change that we are witnessing in 'Fare' column is temporary
# we have to make an axplicit assignment for the changes to take permanent effect
import numpy as np
print('Original Value\n')
print(train['Fare'].head())
print('\nvalue after ceiling\n')
print(train['Fare'].apply(np.ceil).head())
print('\nvalue after log\n')
print(train['Fare'].apply(np.log).head())
print('\nvalue after square root\n')
print(train['Fare'].apply(np.sqrt).head())

Original Value

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

value after ceiling

0     8.0
1    72.0
2     8.0
3    54.0
4     9.0
Name: Fare, dtype: float64

value after log

0    1.981001
1    4.266662
2    2.070022
3    3.972177
4    2.085672
Name: Fare, dtype: float64

value after square root

0    2.692582
1    8.442944
2    2.815138
3    7.286975
4    2.837252
Name: Fare, dtype: float64

In [18]:
# convert each element in the 'Fare' column to int
train['Fare'].apply(int).head()

0     7
1    71
2     7
3    53
4     8
Name: Fare, dtype: int64

In [19]:
train['Name'].apply(len).head()

0    23
1    51
2    22
3    44
4    24
Name: Name, dtype: int64

In [20]:
# read a dataset of alcohol consumption into a DataFrame
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [31]:
# apply the 'max' function along axis 0 to calculate the maximum value in each column
print('\npartial dataframe\n',drinks.loc[:, 'beer_servings':'wine_servings'].head())
print('\ncolumn wise minimum\n',drinks.loc[:, 'beer_servings':'wine_servings'].apply(min, axis=0))

partial dataframe
    beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

column wise minimum
 beer_servings      0
spirit_servings    0
wine_servings      0
dtype: int64

In [24]:
# use 'np.argmax' to calculate which column has the maximum value for each row
drinks.loc[:, 'beer_servings':'wine_servings'].apply(np.argmax, axis=1).head()

0      beer_servings
1    spirit_servings
2      beer_servings
3      wine_servings
4      beer_servings
dtype: object